Revit 2027 API
ParameterTypeId.RebarSystemBarTypeTopDir2Generic Property
 "Top/Exterior Minor Bar Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RebarSystemBarTypeTopDir2Generic { get; }
Public Shared ReadOnly Property RebarSystemBarTypeTopDir2Generic As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RebarSystemBarTypeTopDir2Generic {
	ForgeTypeId^ get ();
}
static member RebarSystemBarTypeTopDir2Generic : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace